---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsRunJustification.Left
enum: Autodesk.Revit.DB.Architecture.StairsRunJustification
source: html/4d75bda7-267b-dc0e-286a-b5efb839655f.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunJustification.Left

The creation path for the run is the left edge.